Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and dataFrame. A series is a one-dimensional array-like object, while a DataFrame is a two dimensional, size-mutable, and profitablity heterogeneous tabular data structure with labeled axes (rows and coulumns).

In [1]:
import pandas as pd

In [4]:
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.Series'>

In [5]:
data={'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name': ['Krish','John','Jack'],
    'Age': [25,30,45],
    'City': ['Bangalore','New York', 'Florida']
}

df=pd.DataFrame(data)
print(df)

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [9]:
## Create a Data Frame froma list of Dictionaries
data=[
    {'Name':'Krish', 'Age':32,'City': 'Bangalore'},
    {'Name':'John', 'Age':32,'City': 'Bangalore'},
    {'Name':'Bobby', 'Age':32,'City': 'Bangalore'},
    {'Name':'Jack', 'Age':32,'City': 'Bangalore'}
]

df=pd.DataFrame(data)
print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   32  Bangalore
2  Bobby   32  Bangalore
3   Jack   32  Bangalore

In [18]:
df1=pd.read_csv('sales_data.csv')
print(df1.head(5))

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [19]:
df1=pd.read_csv('sales_data.csv')
print(df1.tail(5))

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [26]:
data={
    'Name': ['Krish','John','Jack'],
    'Age': [25,30,45],
    'City': ['Bangalore','New York', 'Florida']
}

df=pd.DataFrame(data)
df['Name']

0    Krish
1     John
2     Jack
Name: Name, dtype: str

In [38]:
df.loc[0]['City']

'Bangalore'

In [32]:
df.iloc[0, 2]

'Bangalore'

In [43]:
## Accessing a specified element
df.at[2,'Name']

'Jack'

In [45]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [44]:
## using iat

df.iat[2,2]

'Florida'

In [46]:
### Data Manipulation with DataFrame
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [47]:
df['Salary']=[5000,6000,7000]

In [48]:
df

    Name  Age       City  Salary
0  Krish   25  Bangalore    5000
1   John   30   New York    6000
2   Jack   45    Florida    7000

In [52]:
df.drop('Salary',axis=1,inplace=True)

In [53]:
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [54]:
df['Age']=df['Age']+1

In [55]:
df

    Name  Age       City
0  Krish   26  Bangalore
1   John   31   New York
2   Jack   46    Florida

In [56]:
df.drop(0,inplace=True)

In [57]:
df

   Name  Age      City
1  John   31  New York
2  Jack   46   Florida

In [58]:
df.describe()

             Age
count   2.000000
mean   38.500000
std    10.606602
min    31.000000
25%    34.750000
50%    38.500000
75%    42.250000
max    46.000000